export enum AlertEnum {
    name = "لطفا نام و نام خانوادگی خود را وارد کنید.",
    email = "لطفا آدرس ایمیل را به درستی وارد کنید.",
    password  = "رمز عبور حداقل باید دارای 6 کاراکتر باشد.",
    phone = "لطفا شماره تماس خود را وارد کنید.",
    subject = "لطفا موضوع پیغام خود را بنویسید.",
    comment = "لطفا نظر خود را بنویسید.",
    successLogin = "ورود شما با موفقیت انجام شد.",
    errorLogin = "ایمیل یا رمز عبور اشتباه است، دوباره تلاش کنید.",
    fatalError = "خطایی رخ داده است. دوباره تلاش کنید.",
    successContactComment = "پیغام شما با موفقیت ارسال شد."
}
