import {Injectable} from "@angular/core";

@Injectable()
export class AboutService {

    data: any = {
        jobtitle: "توسعه دهنده و طراح وب",
        aboutme: "فارغ التحصیل رشته مهندسی کامپیوتر گرایش نرم افزار در سال 1393 از دانشگاه آزاد واحد لاهیجان هستم. علاقه و دانش من عمدتا در حوزه طراحی و توسعه وب است و بیش از 7 سال سابقه فعالیت در این حوزه را دارم.",
        phone: "09112489464",
        email: "info@rezanrzdh.ir",
        birthday: "17 دی 1368",
        married: "متاهل هستم",
        militaryservice: "پایان خدمت 1396",
        experience: [
            {
                year: "مهر 1396",
                img: "sava_arman",
                companyname: "ساوا آرمان",
                from: "از 1396 تا 1397",
                desc: "در شرکت ساوا آرمان کیش ابتدا به عنوان موشن گرافیست و سپس طراح UIUX فعالیت کردم. شرکت ساوا آرمان کیش در حوزه ی گردشگری، ارز دیجیتال و درگاه واسط فعالیت داشت.",
                reason: "دلیل اتمام همکاری: انتقال شرکت به تهران"
            },
            {
                year: "آبان 1397",
                img: "plaza",
                companyname: "پلازا",
                from: "از 1397 تا 1400",
                desc: "در شرکت پلازا به عنوان سرپرست گرافیک و طراح UIUX فعالیت کردم. شرکت پلازا در حوزه فروشگاه آنلاین و محتوا و رسانه فعالیت میکند.",
                reason: "دلیل اتمام همکاری: اتمام قرارداد"
            },
            {
                year: "فروردین 1401",
                img: "tosan",
                companyname: "توسن",
                from: "از 1401 تا هم اکنون",
                desc: "در شرکت توسعه سامانه های نرم افزاری نگین ابتدا به عنوان طراح UIUX و سپس به عنوان Developer فعالیت میکنم. شرکت توسن ارائه کننده راهکارهای جامع بانکی، پرداخت و دولت الکترونیک است.",
                reason: "در حال همکاری"
            }
        ],
        skills: [
            {
                title: "طراحی UIUX",
                skill:[
                    "تسلط کامل به فیگما",
                    "توانایی ساخت Icon Pack برای پروژه",
                    "تسلط کامل به Adobe XD",
                    "توانایی طراحی نسخه رسپانسیو",
                    "آشنایی کامل با Zeplin",
                    "توانایی طراحی نسخه موبایل",
                    "تسلط کامل به UIKit و دیزاین سیستم",
                    "آشنایی کامل با تایپوگرافی",
                    "آشنایی کامل به قوانین UX",
                    "آشنایی با مبانی رنگ در طراحی"
                ]
            },
            {
                title: "برنامه نویسی",
                skill:[
                    "مسلط به HTML و SCSS",
                    "آشنایی به فریمورک Angular",
                    "آشنایی به زبان Javascript",
                    "آشنایی به زبان Typescript",
                    "آشنایی به پلتفرم NodeJs",
                    "آشنایی به فریمورک ExpressJs",
                    "آشنایی به دیتابیس MongoDB",
                    "توانایی کار با Github",
                    "توانایی کار با Jira",
                     "آشنایی نسبی به Java"
                ]
            },
            {
                title: "گرافیک دو بعدی",
                skill:[
                    "مسلط به Photoshop",
                    "مسلط به Illustrator",
                    "توانایی طراحی Digital Painting",
                    "توانایی طراحی لوگو و برندبوک",
                    "توانایی طراحی بنر تبلیغاتی"
                ]
            },
            {
                title: "گرافیک سه بعدی",
                skill:[
                    "توانایی کار با Blender",
                    "توانایی کار با 3ds Max",
                    "توانایی کار با Substance 3D Painter",
                    "توانایی ساخت آبجکت های سه بعدی",
                    "توانایی مدلینگ کاراکتر سه بعدی"
                ]
            },
            {
                title: "بازیسازی",
                skill:[
                    "آشنایی با Unreal Engine",
                    "توانایی بازیسازی با زبان ++C",
                    "توانایی ساخت آبجکت های 3D",
                    "توانایی Rig و Animate کاراکتر",
                    "توانایی ساخت Texture",
                    "طراحی Level Design"
                ]
            }
        ],
        language: [
            {
                title: "شنیداری",
                cefr: "B2",
                level: 4
            },
            {
                title: "نوشتاری",
                cefr: "B1",
                level: 3
            },
            {
                title: "خواندن",
                cefr: "B2",
                level: 4
            },
            {
                title: "گفتاری",
                cefr: "A2",
                level: 2
            }
        ]
    }

    constructor() {

    }

    GetAbout():any {
        return this.data;
    }

}
