import {Injectable} from "@angular/core";

@Injectable()
export class EmployersService {

    data: any = [
        {
            name: "عماد بیات",
            company: "مدیر سامانه مدرن شرکت توسن",
            desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز"
        },
        {
            name: "علی عدالت فیض",
            company: "موسس پلازا",
            desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز"
        },
        {
            name: "اعظم بجاری",
            company: "موسس نردبون",
            desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز"
        },
        {
            name: "نیما خوانساری",
            company: "موسس Water World",
            desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز"
        }
    ]

    constructor() {}

    GetEmployersComment(): any {
        return this.data;
    }
}
