import {Injectable} from "@angular/core"

@Injectable()
export class OrdersService {

    data: any = [
        {
            title: "طراحی UIUX",
            icon: "uiux",
            desc: "طراحی  سایت و اپلیکیشن های موبایلی به همراه دیزاین سیستم",
            options: [
                {
                    title: "املاک",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "14 روزکاری",
                                "نسخه ویندوز و موبایل",
                                "صفحه اول",
                                "صفحه درباره ما",
                                "صفحه تماس با ما",
                                "احراز هویت ایمیل و موبایل",
                                "صفحه 404",
                                "صفحه خدمات"
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "25 روز کاری",
                                "تمامی امکانات پلن پایه",
                                "نسخه تبلت",
                                "صفحه مشاوره",
                                "صفحات بلاگ",
                                "صفحه پیشنهاد ویژه",
                                "صفحه FAQ"
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 14900000,
                            props: [
                                "50 روز کاری",
                                "تمامی امکانات پلن حرفه ای",
                                "طراحی رسپانسیو در 5 نسخه",
                                "دیزاین سیستم",
                                "صفحات پروفایل کاربر",
                                "داشبورد ادمین",
                                "صفحه Term of Use",
                                "صفحه Privacy Policy"
                            ]
                        },
                    ]
                },
                {
                    title: "فروشگاهی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "شخصی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "محتوا و رسانه",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "شرکتی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "آموزشی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                }
            ]
        },
        {
            title: "برنامه نویسی",
            icon: "webdev",
            desc: "پیاده سازی سایت های فروشگاهی، املاک، شخصی، محتوا و رسانه، شرکتی و آموزشی",
            options: [
                {
                    title: "محتوا و رسانه",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "شرکتی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "شخصی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "املاک",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "آموزشی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                }
            ]
        },
        {
            title: "طراحی گرافیک",
            icon: "graphic",
            desc: "طراحی بنر سایت، لوگو، آیکون و مدل سازی کاراکتر و اجسام سه بعدی",
            options: [
                {
                    title: "لوگو و برندبوک",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "بنر تبلیغاتی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "کاراکتر",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "آیکون",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                }
            ]
        },
        {
            title: "طراحی بازی",
            icon: "gamedev",
            desc: "طراحی کاراکتر سه بعدی مناسب برای بازی و level design",
            options: [
                {
                    title: "کاراکتر بازی",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                },
                {
                    title: "Level Design",
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                "طراحی رسپانسیو",
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                "طراحی رسپانسیو",
                            ]
                        },
                    ]
                }
            ]
        }
    ];

    constructor() {}


    getOrders(): any {
        return this.data;
    }

}
