import {Injectable} from "@angular/core"

@Injectable()
export class OrdersService {

    data: any = [
        {
            title: "طراحی UIUX",
            icon: "uiux",
            options: [
                {
                    title: "سایت املاک",
                    desc: ""
                },
                {
                    title: "سایت فروشگاهی",
                    desc: "فروشگاه‌های اینترنتی خود به انواع مختلفی تقسیم می‌شوند. نوع اول آن‌ها تولید کننده‌هایی هستند که محصولات خود را از طریق فروشگاه آنلاینی که متعلق به خود است، به فروش می‌رسانند. نوع دوم دقیقاً مشابه فروشگاه‌های سنتی است و به فروش محصولات تولیدی از کارخانه‌ها یا تولیدی‌ها می‌پردازند. نوع سوم فروشگاه‌های اینترنتی معروف به مارکت پلیس هستند در واقع این نوع آنلاین شاپ شبیه به یک بازارچه می‌باشد که هر فروشنده‌ای در آن محصولاتی را می‌فروشد. این محصولات می‌توانند فیزیکی یا مجازی باشند. صاحب فروشگاه اینترنتی از هر تراکنش، مبلغی را به عنوان پورسانت دریافت می‌کند.",
                    props: [
                        "مدت زمان اجرا",
                        "طراحی UI Kit",
                        "طراحی رسپانسیو",
                        "طراحی صفحه اول",
                        "طراحی صفحه لیست مقالات",
                        "طراحی صفحه مقاله",
                        "طراحی صفحه جستجو",
                        "طراحی صفحه درباره ما",
                        "طراحی صفحه تماس با ما",
                        "طراحی صفحه ورود و عضویت",
                        "طراحی صفحه 404",
                        "طراحی صفحه پروفایل کاربر",
                        "طراحی صفحه تبلیغات",
                        "طراحی صفحه استخدام",
                        "طراحی اپ موبایل",
                        "طراحی پنل ادمین"
                    ],
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                false,
                                false,
                                false,
                                false,
                                false
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                "حرفه ای",
                                true,
                                true,
                                false,
                                false
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب بیزنس های اینترپرایز",
                            price: 45900000,
                            props: [
                                "150 روز کاری",
                                "دیزاین سیستم کامل",
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                "پیشرفته",
                                true,
                                true,
                                true,
                                true
                            ]
                        },
                    ]
                },
                {
                    title: "سایت شخصی",
                    desc: ""
                },
                {
                    title: "سایت محتوا و رسانه",
                    desc: "در این گونه سایت ها مطالب عمومی، علمی، تخصصی، فیلم و سریال و ...، در قالب مقاله و خبر به کاربران ارائه میشود. از نمونه سایت های مشابه موجود در جهان میتونیم به medium.com و theverge.com و digitaltrends.com و در ایران هم به zoomg.ir و zoomit.ir و vigiato.net اشاره کنیم.",
                    props: [
                        "مدت زمان اجرا",
                        "طراحی UI Kit",
                        "طراحی رسپانسیو",
                        "طراحی صفحه اول",
                        "طراحی صفحه لیست مقالات",
                        "طراحی صفحه مقاله",
                        "طراحی صفحه جستجو",
                        "طراحی صفحه درباره ما",
                        "طراحی صفحه تماس با ما",
                        "طراحی صفحه ورود و عضویت",
                        "طراحی صفحه 404",
                        "طراحی صفحه پروفایل کاربر",
                        "طراحی صفحه تبلیغات",
                        "طراحی صفحه استخدام",
                        "طراحی اپ موبایل",
                        "طراحی پنل ادمین"
                    ],
                    plans: [
                        {
                            title: "پایه",
                            desc: "مناسب شروع کسب و کار",
                            price: 3900000,
                            props: [
                                "13 روز کاری",
                                "کامپوننت های اصلی",
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                false,
                                false,
                                false,
                                false,
                                false
                            ]
                        },
                        {
                            title: "حرفه ای",
                            popular: true,
                            desc: "مناسب رشد و حرفه ای شدن کسب و کار",
                            price: 7900000,
                            props: [
                                "20 روز کاری",
                                "کامپوننت های مورد نیاز پروژه",
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                "حرفه ای",
                                true,
                                true,
                                false,
                                false
                            ]
                        },
                        {
                            title: "پیشرفته",
                            desc: "مناسب شروع کسب و کار",
                            price: 14900000,
                            props: [
                                "40 روز کاری",
                                "دیزاین سیستم کامل",
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                true,
                                "پیشرفته",
                                true,
                                true,
                                true,
                                true
                            ]
                        },
                    ]
                },
                {
                    title: "سایت شرکتی",
                    desc: ""
                },
                {
                    title: "سایت آموزشی",
                    desc: ""
                }
            ]
        },
        {
            title: "برنامه نویسی",
            icon: "webdev",
            options: [
                {
                    title: "سایت محتوا و رسانه",
                    desc: "در این گونه سایت ها مطالب عمومی، علمی، تخصصی، فیلم و سریال و ...، در قالب مقاله و خبر به کاربران ارائه میشود. از نمونه سایت های مشابه موجود در جهان میتونیم به medium.com و theverge.com و digitaltrends.com و در ایران هم به zoomg.ir و zoomit.ir و vigiato.net اشاره کنیم."
                },
                {
                    title: "سایت شرکتی",
                    desc: ""
                },
                {
                    title: "سایت شخصی",
                    desc: ""
                },
                {
                    title: "سایت املاک",
                    desc: ""
                },
                {
                    title: "سایت آموزشی",
                    desc: ""
                }
            ]
        },
        {
            title: "طراحی گرافیک",
            icon: "graphic",
            options: [
                {
                    title: "لوگو و برندبوک",
                    desc: ""
                },
                {
                    title: "بنر تبلیغاتی سایت",
                    desc: ""
                },
                {
                    title: "بنر تبلیغاتی متحرک",
                    desc: ""
                },
                {
                    title: "طراحی کاراکتر",
                    desc: ""
                },
                {
                    title: "طراحی آیکون",
                    desc: ""
                }
            ]
        },
        {
            title: "طراحی بازی",
            icon: "gamedev",
            options: [
                {
                    title: "طراحی کاراکتر بازی",
                    desc: ""
                },
                {
                    title: "طراحی level design",
                    desc: ""
                }
            ]
        }
    ];

    constructor() {}


    getOrders(): any {
        return this.data;
    }

}
